#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "easy-food"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "pos-tech",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::471112648522:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.access-policy will be created
  + resource "aws_eks_access_policy_association" "access-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "easy-food"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::471112648522:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.easy-food-eks will be created
  + resource "aws_eks_cluster" "easy-food-eks" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "easy-food"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::471112648522:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.27"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-02d666d6425af6722",
              + "subnet-05197ae35fa1c7bab",
              + "subnet-07a778975c3b70443",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "easy-food"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "NG-easy-food"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::471112648522:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-02d666d6425af6722",
          + "subnet-05197ae35fa1c7bab",
          + "subnet-07a778975c3b70443",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 5
          + min_size     = 3
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.sg-eks will be created
  + resource "aws_security_group" "sg-eks" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "SG-easy-food-eks"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b487ce478bbfd0e7"
    }

  # helm_release.nginx-ingress will be created
  + resource "helm_release" "nginx-ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "easy-food-nginx"
      + namespace                  = "nginx-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.10.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.nginx-ingress will be created
  + resource "kubernetes_namespace" "nginx-ingress" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Rodrigo1895, Action: `pull_request`*